{
  "filename": "Horizon Doc Proposal-2.docx",
  "type": "docx",
  "text_content": [
    "Prepared for:",
    "Nhung Nguyen, Horizon Legacy",
    "Prepared by:",
    "Johnny Hockin & Nina Gilmour, Juniper Island",
    "Date:",
    "July 7, 2025",
    "PROJECT OVERVIEW",
    "We propose a multi-format video documentation strategy for",
    "Eh ni da se",
    ", the world’s largest Indigenous housing development using onsite robotics. This series will highlight the project’s innovation, cultural roots, and real-world impact across construction, housing equity, and Indigenous sovereignty. Content will be designed to serve Horizon Legacy’s goals for storytelling, media visibility (LinkedIn/social/public relations), investor relations, and future project promotion.",
    "We see this as an exciting and unique opportunity to not just document the build—but to shape the public understanding of what Horizon Legacy is becoming.",
    "OBJECTIVES",
    "Document the construction process from breaking ground to ribbon-cutting",
    "Highlight the role of robotics in building more affordably and efficiently",
    "Showcase the integration of robotics and culturally rooted architecture",
    "Amplify Indigenous voices, especially Principal Architect Brian Porter",
    "Shift the perception of construction by showcasing improved working conditions and new career pathways in robotics",
    "Establish Horizon Legacy’s position as a robotics-driven innovator in the",
    "construction industry",
    "Create both high-production and lo-fi assets for multiple distribution channels",
    "Build a library of usable, branded, evergreen B-Roll, including a construction timelapse",
    "Explore the project’s intersection with broader issues to maximize audience engagement and public relations opportunities: housing equity, technology, sustainability, and Indigenous reconciliation",
    "SCOPE OF WORK",
    "A. Pre-Production (July-August 2025)",
    "Script and Scheduling",
    "– Juniper Island leads a collaborative brainstorming process and develops initial script drafts for Horizon Legacy review and approval.",
    "Stakeholder Alignment",
    "– Juniper Island and Horizon Legacy jointly present the project plan to Principal Architect Brian Porter of Two Row Architect for input and alignment.",
    "B. High-Production Shoots (5 total site visits, 5+ key interviews)",
    "Shoot 1 (August 2025):",
    "Groundbreaking, architect and exec interviews",
    "Shoot 2 (Winter/Spring):",
    "Robotics in action, mid-construction status",
    "Shoot 3",
    "(Summer 2026)",
    "Final stages",
    "walk",
    "through",
    "Shoot 4",
    "(Fall 2026)",
    "Completion, resident/community impact interviews",
    "Shoot 5",
    "(Optional Add-on):",
    "Any milestone event requiring extra capture",
    "C. Lo-Fi Monthly/Bi-Monthly Clips",
    "Scripted and planned by us with Horizon Legacy team",
    "Shot by our team with minimal gear",
    "to maintain flexibility and intimacy while keeping things cost-effective",
    "Short updates with featured staff, architect, or team leads - progress reports and/or storytelling from community or staff on progress",
    "Emphasis on real-time documentation, philosophy, problems solved, tech in action. Optimistic, practical.",
    "10–15 clips over 14–16 months",
    "D. Time-Lapse Support",
    "Plan and manage capture by time-lapse cameras from day one",
    "Coordination with team members on site",
    "Procurement and management of camera equipment",
    "E. B-Roll Library",
    "Curated, licensed, and organized high quality raw assets of site preparation, robotics in action, construction process, landscapes, and the finished project",
    "Useful for press, partners, LinkedIn, funding decks, and future storytelling",
    "DELIVERABLES",
    "1 x Final Documentary (3–8 minutes)",
    "– Cinematic, scored, subtitled, and colour-graded. This is the capstone piece, shaped from our full production schedule and designed for YouTube release and wide appeal—investors, press, public relations, and internal use.",
    "3 x Social Cutdowns (30–90 seconds)",
    "– Short, sharp social videos will help build anticipation and audience connection in the months leading up to its release, and provide a vertical-optimized version of the capstone video to live on platforms like Instagram. Delivered in vertical and square formats, as needed.",
    "15 x Lo-Fi Updates",
    "– Handheld-style real-time process updates, in vertical video only",
    "Full B",
    "Roll Library (organized, named, licensed)",
    "– Construction, site, robotics, establishing shots",
    "COLLABORATION APPROACH",
    "We’ll work closely with Two Row Architect to ensure the narrative, cultural presentation, and tone are appropriate and grounded in Indigenous values.",
    "We are open to providing basic training and freelance camera/editing work to members of the local Indigenous community, and would collaborate with the architect’s network to facilitate this.",
    "We’ll handle all lo-fi content internally to ensure consistency, narrative clarity, and quality—while keeping the production process easy on your side.",
    "Juniper Island and Horizon Legacy will coordinate to optimize shoots by doubling up as often as possible",
    "- filming",
    "doc style footage along with lo-fi videos so we can maximize everyone",
    "’s time.",
    "TONE & STYLE",
    "Grounded, cinematic, and observational",
    "Beautiful, future-forward and polished",
    "Aesthetic of restraint: subtly polished where needed, intimate where appropriate",
    "Combines process, philosophy, and personality",
    "NEXT STEPS",
    "Pending approval, we will schedule a kickoff call in July, visit the site before August, plan our first August shoot day, and begin the setup of time-lapse infrastructure. A draft production calendar and budget will be delivered following confirmation of scope.",
    "INVESTMENT",
    "We’ve outlined two investment tiers based on the desired project scope:",
    "Full Scope Package – $81,300 CAD",
    "Covers the entire project as outlined above, including all site visits, lo-fi updates, final documentary, time-lapse support, and B-roll delivery.",
    "Payable in monthly installments of $4,517 over 18 months.",
    "Lean Package – $",
    ",600 CAD",
    "A more compact version focused on",
    "site visits",
    "including 5 interviews",
    ", the final documentary",
    "and its corresponding",
    "social cutdowns, and time-lapse support.",
    "This package",
    "excludes",
    "the monthly updates and B-Roll library, focusing strictly on milestone documentation.",
    "Payable in 4 installments of $",
    "50 or custom payment schedule.",
    "These prices are based on preliminary planning and will be finalized with a detailed scope and timeline.",
    "Prepared by:",
    "Johnny Hockin and Nina Gilmour",
    "Juniper Islan",
    "This section outlines how we work—our systems for communication, delivery, budgeting, and client success.",
    "Our goals are to see our projects through with highly organized and pro-active client communication. To us, a successful project starts with clear objectives—and a shared creative vision between client and team from day one.",
    "We are always looking for a way to approximate the final product ahead of time to allow for feedback and signoff before we arrive on set, whether it’s clear scripts, rehearsals, running scenarios, or creating mock-ups. The worst thing that can happen to a project is that our client is surprised by the way things are delivered.",
    "This is why our projects all start with clear cut",
    "Statement of Work",
    "documents. These include a work schedule, key dates, a comprehensive list of deliverables, a budget breakdown, a pay schedule, and executed signatures so that we all know that we’re starting on the same page. It’s an important reference document as we move through the project, and has been invaluable in the rare case of any misunderstandings or conflicts.",
    "Creative Project Management",
    "Producer and head of operations Nina Gilmour leads project logistics with a focus on aligning timelines, on-camera subjects, and stakeholders to keep work moving smoothly and efficiently.",
    "Timeline Management",
    "We hold weekly internal standups and client check-ins as needed. We track all team hours using Harvest and have never required a major rescope due to budget overrun.",
    "Budget Accuracy",
    "We prepare detailed estimates and actualized budgets. Fair quoting and transparency are key to our sustainability and client trust.",
    "Our Interviews",
    "We’ve conducted thousands of interviews and pride ourselves on drawing out natural, engaging moments—even from subjects who aren’t used to being on camera. We carefully plan our setups and questions to create a relaxed atmosphere that encourages thoughtful, human responses. Our interviews take time, but that time is well spent: it’s how we capture material that cuts through and presents people in their best light.",
    "Rights & Legal",
    "We manage on camera appearance and location releases, music and footage licenses, and copyright clearances in-house or via vetted visual researchers when needed.",
    "Subcontractors",
    "We vet all external collaborators and handle all creative direction and paperwork. Clients remain protected and free from extra admin load.",
    "Infrastructure",
    "We own industry-standard camera, audio, and lighting gear, including a Sony FX6 package. All projects are securely backed up and delivered through pro tools like Frame.io and Vimeo Pro.",
    "We approach every project as a collaboration—not just a delivery. Your success is our creative metric.",
    "The Challenge",
    "– for Muskoka Roastery Coffee Co.",
    "A 15-minute branded documentary on Canada’s most extreme amateur canoe race. We followed teachers-turned-athletes who train for this overnight wilderness challenge—produced as a follow-up to our first successful film with the brand.",
    "Watch full film",
    "Social version",
    "Howling: The Call of the Wild",
    "– for Muskoka Roastery Coffee Co.",
    "An immersive documentary exploring the mystique of the Algonquin wolf and its significance to conservationists, scientists, and local Indigenous voices. Created to deepen the brand’s association with wilderness, connection, and introspection.",
    "Watch full film",
    "15-second cut",
    "2025/26 Season Trailer",
    "– for Toronto Symphony Orchestra",
    "We were engaged to create a series of trailers to support the TSO’s 2025/26 season launch, each tailored to different audiences and formats. This piece is the anchor trailer—emotive, cinematic, and built around Gustavo Gimeno’s personal reflections. Shorter, high-energy variations are forthcoming for broader public release.",
    "Watch full trailer",
    "Teaser",
    "Friendlier x Coca-Cola x Toronto Zoo",
    "A case study campaign capturing a first-of-its-kind reuse partnership at the Toronto Zoo, supported by Coca-Cola. We created four separate videos—from polished partnership storytelling to UGC-style explainers—tailored for vertical and horizontal formats. All content featured real guests, staff, and stakeholders, filmed on a single intensive production day.",
    "Watch partnership case study",
    "Meat Cute",
    "– for Subway Canada & Dentsu Creative",
    "A one-week turnaround Valentine’s campaign built around real blind dates, shot live inside an open Subway restaurant. We handled casting, filming, and post—balancing fly-on-the-wall intimacy with a cinematic finish. The campaign earned 10M+ views and 8M+ engagements.",
    "Campaign summary video"
  ],
  "images": [
    {
      "name": "image2.png",
      "size": 70,
      "path": "images/image2.png"
    },
    {
      "name": "image7.png",
      "size": 17481,
      "path": "images/image7.png"
    }
  ]
}