[
  {
    "filename": "Juniper Island Prod - 2024 VOR - Question 2-3-3.docx",
    "type": "docx",
    "text_content": [
      "Juniper Island Productions - Question 2.3.3",
      "Provide a list of up to five (5) Ontario or Canada-based clients that your organization produced work for in the past 24 months. Provide a brief description of what you did for them (i.e., two to three sentences) in a single PDF file attachment.",
      "Canadian Media Producers Association",
      "We produced their brand sizzle video, which played a crucial role in their branding strategy, including video and music editing, creative direction, animation, and securing rights to footage and music. View it here:",
      "https://vimeo.com/907909480/9359f525ae",
      "Designed signage for their Prime Time conference in Ottawa, enhancing the conference’s branding, visual experience and wayfinding. Additionally, we edited and made accessible their online event talks, delivering an average of 20 videos annually.",
      "We’ve produced video event coverage for their Indiescreen Awards press conference and mixer at TIFF (1 landscape video per year for YouTube)",
      "Subway Canada/Dentsu Creative",
      "Collaborated with Dentsu Creative to execute",
      "Meat Cute",
      ", a successful social media campaign for Subway. We managed all aspects of production, including directing and post-production, resulting in high engagement on social media platforms. Watch the summary video here:",
      "https://vimeo.com/938818301/c939bc7d4f",
      "Rily.co",
      "As creative directors and social media managers for Rily.co, we have significantly grown their",
      "Instagram",
      "following from 150 to over 36,000 in three years by producing engaging content that resonates with their audience.",
      "We produce and post 3-4 social media videos per week for Rily, regularly spotlighting local Ontarian chefs",
      "Toronto Metropolitan University",
      "We created a series of videos explaining to prospective students about their image arts graduate programs. 2 x 5 minute videos",
      "Samuel Centre for Social Connectedness",
      "We created video coverage of their regular",
      "Global Symposium on Belonging",
      "events - including a mini-doc on the event and editing and captioning 20+ talks over 2 years",
      "Metcalf Foundation",
      "We produced informational videos for their grantee community outreach - 2 x 20m landscape videos",
      "Juniper Island Productions - Question 2.4.2 - Best Creative/Parallel Work Example",
      "Meat Cute",
      "- In partnership with Subway Canada & Dentsu Creative",
      "Creative",
      "View the campaign summary video -",
      "https://vimeo.com/938818301/c939bc7d4f",
      "Problem",
      "Dentsu Creative got in touch with us at the end of January with a last minute idea for their client Subway for Valentine’s Day. Their ask: could we stage a series of blind dates in a Subway and help people spark some IRL romantic connections? (IRL is internet-speak for “in real life”).",
      "They were looking for a partner who understood the social media landscape, and who could take care of everything, including finding a way to film it, building out the crew, and all the directing and storytelling including all aspects of post-production.",
      "We would have to film it 7 days later, and to release it by Valentine’s Day we would have to finish post-production 5 days after that. It was a tall order, but we loved the idea and we like a challenge.",
      "They wanted to make sure that the dates were real, candid, and hopefully led to authentic connections. They wanted it to look as cinematic and premium as possible, while also having a fly-on-the-wall feel. Given the size of most cinema cameras (large) and most Subway restaurants (small) we didn’t have much space to work with.",
      "Dentsu provided a street team and host to help us gather up the public and some simple romantic decorations, but the key to our success was going to be capturing the real emotional moments of our daters—and making it look good. With this in mind, we worked to roleplay every possible scenario ahead of time.",
      "Solution",
      "We immediately went down to the nearest Subway and began deciding on our creative solution. We would use smaller Sony cameras with documentary lenses, and capture 4 angles of the action, plus 2 installed GoPro cameras.",
      "The store had to remain open and we weren’t allowed to use any lights, so we chose a table behind a pillar, affording our daters some privacy that would help them open up to each other. This table also gave us a view of signage and posters that were important to the client, as well as the best possible natural backlighting coming through the window.",
      "Our creative director and director of this piece Johnny Hockin started his career as an interviewer at MTV Canada, and has conducted thousands of interviews in his career, so he has an understanding of the subtleties that are important for bringing people out of their shell on camera. In this case it largely meant staying out of their way and allowing natural things to happen. The best way we could encourage chemistry without meddling with our daters was to prompt them with open-ended questions on their subs (e.g. “what’s your love language?” or “if you could be any animal, what would you be?”).",
      "Once we had captured 12 dates over the course of 6 hours of shooting, we picked things up in the edit suite. We put together rough cuts that emphasized everything that a social media piece needs. And we advocated for these things throughout the process - intrigue, a strong opening, and fast paced cuts.",
      "Our biggest challenge at this point was the different needs of our stakeholders: the agency creative director was advocating for a piece that underlined the seriousness and importance of communicating in person. Meanwhile the Subway social team’s point of view was that it had to be fun, punchy, and controversial. We did everything we could to tick all the boxes while we deliberated as a group what the best path forward was. The Subway marketing team was a very effective arbitrator and as a result of the conversation and debate, we felt that the piece was made much better (fun, with a nod to the importance of IRL communication).",
      "Result",
      "By the end of our work, our favourite dates were cut into 2 x 15-second teaser videos to generate anticipation with the public, and 1 longer video (1:15) to pay off the campaign.",
      "View the social media post here -",
      "https://vimeo.com/951289585/bd9f4f0b43",
      "The results were almost immediate. Within a day of the teasers going up we saw views hit 500k between TikTok and Instagram posts. And after the smoke had cleared at the end of the week, the posts saw 10 Million views and over 8 Million engagements.",
      "Like a fun reality dating show, the audience connected with our characters, wanted to know more about them, and loved bantering about the dates. It was a major success, right in line with what Dentsu dreamed of when they pitched the idea, and with the sassy fun response that the Subway social media team was looking for.",
      "Dentsu was very pleased with the result, and further engaged us to create an asset to show for potential awards recognition (the",
      "campaign summary video",
      "posted at the top of the first page). We have since worked with them again as a production partner.",
      "Juniper Island Productions - Question 2.4.3 - 2nd Best Creative/Parallel Work Example",
      "Howling: The Call of the Wild",
      "in partnership with Muskoka Roastery Coffee Co.",
      "Creative",
      "Watch the Short doc (15m) -",
      "https://www.youtube.com/watch?v=FeGJw5FvMaA",
      "Social asset (15-second version) -",
      "https://vimeo.com/944520693/53f9168ab1",
      "Problem",
      "Muskoka Roastery Coffee Co. was interested in taking their brand storytelling up a level by releasing a documentary film that brought their customers more in touch with the Canadian wilderness roots of their product. While they roast their coffee in Muskoka, they sell it around the country and the world, and they had heard from their customers that a large part of their brand’s appeal was the way it stood for the wholesome majesty of the Canadian wilderness.",
      "Their coffee is well made, carefully roasted, and their hope was that it can take you to a place of oneness with nature, solitude and connectedness. They wanted a film that could demonstrate their brand by doing that for the viewers. A film that might help the viewer feel more connected to nature, and that might inspire them to get out and enjoy nature themselves.",
      "They tasked us with finding subjects for their film that might fit the bill, and gave us 6 months of research and end-to-end production time to come up with a film that fit this brief, as well as a number of social assets. While our budget was limited, as we had only $60,000CAD for the total project and a potential shooting schedule of 7-14 days, we had time to carefully prepare, and could build shoot days around various crew sizes, depending on the day’s needs.",
      "The roastery’s measures of success were that they wanted the film to resonate with their core audience and their Huntsville community and employees, and they wanted the film to help their brand perception and awareness around the country as they prepared to move towards global distribution.",
      "Solution",
      "We spoke with over a hundred potential subjects, relating to 14 different topic storylines before settling on the Algonquin Wolf. The wolf’s embodiment of the stillness and nobility of the wilderness, its unique geographical relevance to the Roastery, and the intriguing scientific and Indigenous characters made it interesting to us and the client.",
      "We worked closely with the client at every stage to select our stories and our approaches, providing them with research reports, storyboards, scripts, and cuts to comment on. The only way we were able to earn the creative freedom we needed to complete the project on budget was to give them as many chances as possible to weigh in and make them heard.",
      "We worked with Waaseyaa Consulting’s Christina Luckasavitch, an Indigenous consultant who  lives right in the middle of the wolves’ territory. She introduced us to well-known local naturalist Michael Runtz, who is one of the core subjects of the film. She also helped us collaborate with the Magnetawan First Nation, whose conservation activities around turtles are well known, and whose territory overlaps with the wolves. Their elders agreed to lend their time and knowledge to the project in exchange for some archival video work.",
      "We worked with cinematographer Jack Yan Chen, a huge fan of the Canadian outdoors, to capture the look and feel of the piece - as immersive as we could, transporting the viewer into the bush, with teams as small at times as 2 people, at times as many as 8, hiking as much as 90 minutes into the back woods to capture our material.",
      "One central problem of the film as it was coming together was that a large part of the relationship that locals have with the animals are the wolf howls that have been on pause for years (in large part due to COVID-19). Hundreds of people would gather late afternoon into the evening and howl into the air, led by naturalists like Michael Runtz. Our solution for this was to help dramatize one of Michael’s private wolf howls—the same thing can be conducted by private groups, and we sent a local family with Michael to learn how to howl and investigate whether they could communicate with the wolves by howling.",
      "Result",
      "By the end of our 6 month timeline, the film was completed and released to the public, along with 6 social assets, including a",
      "15 second version",
      ". The client was exceptionally happy with it, and greenlit another budget for us to film our runner up idea (a film about a 24-hour canoe race).",
      "The film was well received by the public, earning more than 50,000 organic views in a 3-month period, and increasing engagement on MRCC’s social channels.  The follow-up film received 250,000 views and another round of positive feedback from the public, marking a successful campaign around the 2 films, and preparing MRCC for their brand positioning as they moved into global sales.",
      "Juniper Island Productions - Question 2.4.4 - 3rd Best Creative/Parallel Work Example",
      "Spaces: Montreal and Spaces: Vancouver",
      "in partnership with Red Bull Music Academy Canada",
      "Creative",
      "Watch the 4-minute mini-doc:",
      "https://vimeo.com/396733644",
      "Problem",
      "Red Bull Canada’s media team was looking for content for the brand’s international YouTube Channel for music and their Music section of their website. They reached out to the journalists and producers that they had worked with before to take in pitches that could portray uniquely Canadian stories that their global audience would respond to.",
      "They wanted to profile Canadian musical artists, but for the documentary shorts to be more than simply a profile: they wanted them to spotlight a story or trend in the arts scene and music industry that was defining the current moment. They also had mandates for diversity and inclusion that they wanted fulfilled by the work.",
      "Our creative director Johnny Hockin had been working with Canadian-based artists as part of the Red Bull Music Academy team in Toronto, producing radio shows, podcasts, and video projects for the YouTube channel. Given this opportunity to pitch, he reached out to a number of artists in his network to find out what issues and stories were resonating with them.",
      "One of the most interesting issues was around artistic spaces. Venues were shutting down, practice spaces and artistic spaces were becoming less and less viable, but Canadian artists were persevering and finding ways to make it work for them. This story of determination in the face of adversity played out in cities across the country, and was tied to some of the strongest and most powerful artists, and made a natural pitch.",
      "Red Bull Canada was excited by the proposal and greenlit us for a 6-month production period, from pre- to post-production, with a budget of $50,000 for two films, one in Vancouver and one in Montreal.",
      "Solution",
      "Researching local artists, we identified compelling stories of artists persevering despite these challenges. This included internet radio stations and record labels run out of loft spaces, popular nightlife events that used cultural centres and underused community space, and artists sharing studio spaces with each other in their homes.",
      "We pre-interviewed potential subjects and prepared them for inclusion, and then collaborated with Red Bull’s team as a type of jury to score potential candidates, measuring the strength of their story, their artistic output, the visual interest of their space, and their ability to be comfortable on camera.",
      "Once we’d confirmed our subjects, we assembled small production crews of locals in each city, and made the most of our limited shoot days to achieve a cohesive story. We used young cinematographers, sound recordists, some of whom have had careers blossom in the years since we worked with them.",
      "Documentary style shooting has its challenges, for instance in some cases despite our planning, the unexpected would come up - a space not being available anymore, or natural light simply not agreeing with us. But we maintained regular communication with Red Bull Canada's media team, sending shoot reports and planning for backup material in case of difficulty.",
      "Because some of our subjects were concerned about the precarity of their spaces, we had to film them discreetly and secretly, in a way where we wouldn’t give away their location, which was an interesting wrinkle. Red Bull’s initial desire was to shine a light on these spaces, and perhaps even “make them famous”—but our team advocated for listening to the artist’s wishes in the name of bettering the story. Mystery and intrigue",
      "usually make for more compelling narratives. The brand eventually agreed with our take, and it helped to make the pieces stronger.",
      "At the end of a summer of shoots, we delivered the 2 pieces on time and on budget.",
      "Result",
      "Our Spaces mini docs appeared on the Red Bull Music global YouTube channel as well as teasers and short forms on Instagram, Facebook and Twitter. The brand was so happy with the assets that they chose to later re-use the Montreal pieces as promotional material for the Red Bull Music Academy festival which took place in Montreal the following year.",
      "After the project was complete we had delivered more than 20 different assets, and earned over 800k views across all platforms.",
      "Our team continued to work successfully with Red Bull Music for another year until the global brand mandate changed to downplay music content and focus on sports.",
      "Juniper Island Productions - Question 2.4.6",
      "Project, Production and Budget Management Processes",
      "Our goals with our projects are to see them through with highly organized and pro-active communication with our clients. To us, a successful project involves clear objectives and creative that client and team are aligned on going in.",
      "We are always looking for a way to approximate the final product ahead of time and allow for feedback and signoff before we arrive on set, whether it’s clear scripts, rehearsals, running scenarios, or creating mock-ups. The worst thing that can happen to a project is that our client is surprised by the way things are delivered.",
      "This is why our projects all start with clear cut",
      "Statement of Work",
      "documents. These include a work schedule, key dates, a comprehensive list of deliverables, a budget breakdown, a pay schedule, and executed signatures so that we all know that we’re starting on the same page. It’s an important reference document as we move through the project, and has been invaluable in the rare case of any misunderstandings or conflicts.",
      "Producer Nina Gilmour was a trained actor and theatre producer before joining the team, and has worked professionally in the arts her whole career. She is extremely adept at organizing projects and working to help all kinds of personalities and points of view to get aligned and to see things through in a timely and efficient manner.",
      "Managing Timelines",
      "We have weekly internal standup meetings to go over project statuses and orient ourselves each week within our project timelines. We do the same externally with many of our clients, especially our long-term clients.",
      "We believe in standing by our word, and we’re proud to say that we have never had a project to date go over budget significantly enough to require a major redefinition of a scope. All of our team’s time is tracked with a software called Harvest.",
      "Managing Budgets",
      "We create detailed budget breakdowns at the pitch stage for all our production costs internal and external (crew, equipment, travel, etc.), and we convert this to a working budget during the project, and an actualized final budget post project. As a young business less than 10 years in, it’s important to us to fairly and accurately quote work to our clients, and to watch our profitability and ability to pay our teams fairly.",
      "Managing Talent",
      "We have worked with non-union actors as well as on ACTRA projects, and we are in good standing with the union. Even on non-union projects, we have clear contracts and agreements that we use with featured artists and on-screen talent that cover all necessary rights issues to legally protect our clients and projects.",
      "We have experience coordinating with talent managers or representatives for scheduling and logistics, and we work to ensure a respectful and professional on-set environment for all talent.",
      "Our creative director Johnny Hockin has worked with just about every type of on-camera personality, having started his career as a broadcast personality himself, interviewing film stars and political figures, and moving to directing actors of all levels of experience.",
      "He is also good at getting relaxed and natural performances out of non-actors, whether it’s a business leader speaking about their upcoming product or a regular family embarking on an adventure.",
      "Intellectual Property Rights",
      "We always obtain necessary releases and permissions for on-screen talent, locations, and archival footage. We have access to extensive music and stock footage libraries, and always obtain legal clearance for any copyrighted material used above and beyond our library access.",
      "We have worked on a number of complex projects involving the use of extensive archival and personal footage, and in those cases, we have collaborated with freelance visual researchers to help us find and clear the rights to everything the project requires. Visual researchers have contacts in various archives and discounts at all of the footage-licensing libraries, and take care of all of the legal and organizational sides.",
      "Managing Subcontractors",
      "We have a network of regular collaborators that we work with, and can rely on. In all cases, we conduct thorough vetting and selection processes for subcontractors. In most cases, we handle all of the client-facing creative direction, and bring on help with execution, so most of our clients will not have to deal with any added administration or tasks with respect to other collaborators. In the rare case that a client project needs creative talents that we don’t offer (e.g. particularly stylized stills photography), we are transparent with our clients and let them weigh in before we hire talent.",
      "We always established clear deal memos and/or scope of work agreements with subcontractors to make sure that there are no rights issues or misunderstandings.",
      "Team Assets",
      "Our studio has an extensive amount of gear, including a Sony FX6 camera, professional lenses, lighting equipment, and audio equipment. This can give us great pricing flexibility, as we set our rental rates based on our clients, e.g. we can give beneficial rates for good causes or projects with high alignment with our values, or to stretch a budget to work with a client we want to work with.",
      "We use the Adobe suite as well as Davinci Resolve for our projects, but also have experience using Final Cut Pro and Avid. We have professional Vimeo and Google Drive and Frame.io accounts to help us deliver projects to clients and to allow client review of projects.",
      "We have relationships with local studio spaces and can negotiate beneficial rates with them for shoot days.",
      "All of our projects are minimum double-backed-up in secure hard drive storage, including all assets, footage and project files. If, at a later date, a project needs to come out of the archive, we will have it at the ready."
    ],
    "images": []
  },
  {
    "filename": "Horizon Doc Proposal-2.docx",
    "type": "docx",
    "text_content": [
      "Prepared for:",
      "Nhung Nguyen, Horizon Legacy",
      "Prepared by:",
      "Johnny Hockin & Nina Gilmour, Juniper Island",
      "Date:",
      "July 7, 2025",
      "PROJECT OVERVIEW",
      "We propose a multi-format video documentation strategy for",
      "Eh ni da se",
      ", the world’s largest Indigenous housing development using onsite robotics. This series will highlight the project’s innovation, cultural roots, and real-world impact across construction, housing equity, and Indigenous sovereignty. Content will be designed to serve Horizon Legacy’s goals for storytelling, media visibility (LinkedIn/social/public relations), investor relations, and future project promotion.",
      "We see this as an exciting and unique opportunity to not just document the build—but to shape the public understanding of what Horizon Legacy is becoming.",
      "OBJECTIVES",
      "Document the construction process from breaking ground to ribbon-cutting",
      "Highlight the role of robotics in building more affordably and efficiently",
      "Showcase the integration of robotics and culturally rooted architecture",
      "Amplify Indigenous voices, especially Principal Architect Brian Porter",
      "Shift the perception of construction by showcasing improved working conditions and new career pathways in robotics",
      "Establish Horizon Legacy’s position as a robotics-driven innovator in the",
      "construction industry",
      "Create both high-production and lo-fi assets for multiple distribution channels",
      "Build a library of usable, branded, evergreen B-Roll, including a construction timelapse",
      "Explore the project’s intersection with broader issues to maximize audience engagement and public relations opportunities: housing equity, technology, sustainability, and Indigenous reconciliation",
      "SCOPE OF WORK",
      "A. Pre-Production (July-August 2025)",
      "Script and Scheduling",
      "– Juniper Island leads a collaborative brainstorming process and develops initial script drafts for Horizon Legacy review and approval.",
      "Stakeholder Alignment",
      "– Juniper Island and Horizon Legacy jointly present the project plan to Principal Architect Brian Porter of Two Row Architect for input and alignment.",
      "B. High-Production Shoots (5 total site visits, 5+ key interviews)",
      "Shoot 1 (August 2025):",
      "Groundbreaking, architect and exec interviews",
      "Shoot 2 (Winter/Spring):",
      "Robotics in action, mid-construction status",
      "Shoot 3",
      "(Summer 2026)",
      "Final stages",
      "walk",
      "through",
      "Shoot 4",
      "(Fall 2026)",
      "Completion, resident/community impact interviews",
      "Shoot 5",
      "(Optional Add-on):",
      "Any milestone event requiring extra capture",
      "C. Lo-Fi Monthly/Bi-Monthly Clips",
      "Scripted and planned by us with Horizon Legacy team",
      "Shot by our team with minimal gear",
      "to maintain flexibility and intimacy while keeping things cost-effective",
      "Short updates with featured staff, architect, or team leads - progress reports and/or storytelling from community or staff on progress",
      "Emphasis on real-time documentation, philosophy, problems solved, tech in action. Optimistic, practical.",
      "10–15 clips over 14–16 months",
      "D. Time-Lapse Support",
      "Plan and manage capture by time-lapse cameras from day one",
      "Coordination with team members on site",
      "Procurement and management of camera equipment",
      "E. B-Roll Library",
      "Curated, licensed, and organized high quality raw assets of site preparation, robotics in action, construction process, landscapes, and the finished project",
      "Useful for press, partners, LinkedIn, funding decks, and future storytelling",
      "DELIVERABLES",
      "1 x Final Documentary (3–8 minutes)",
      "– Cinematic, scored, subtitled, and colour-graded. This is the capstone piece, shaped from our full production schedule and designed for YouTube release and wide appeal—investors, press, public relations, and internal use.",
      "3 x Social Cutdowns (30–90 seconds)",
      "– Short, sharp social videos will help build anticipation and audience connection in the months leading up to its release, and provide a vertical-optimized version of the capstone video to live on platforms like Instagram. Delivered in vertical and square formats, as needed.",
      "15 x Lo-Fi Updates",
      "– Handheld-style real-time process updates, in vertical video only",
      "Full B",
      "Roll Library (organized, named, licensed)",
      "– Construction, site, robotics, establishing shots",
      "COLLABORATION APPROACH",
      "We’ll work closely with Two Row Architect to ensure the narrative, cultural presentation, and tone are appropriate and grounded in Indigenous values.",
      "We are open to providing basic training and freelance camera/editing work to members of the local Indigenous community, and would collaborate with the architect’s network to facilitate this.",
      "We’ll handle all lo-fi content internally to ensure consistency, narrative clarity, and quality—while keeping the production process easy on your side.",
      "Juniper Island and Horizon Legacy will coordinate to optimize shoots by doubling up as often as possible",
      "- filming",
      "doc style footage along with lo-fi videos so we can maximize everyone",
      "’s time.",
      "TONE & STYLE",
      "Grounded, cinematic, and observational",
      "Beautiful, future-forward and polished",
      "Aesthetic of restraint: subtly polished where needed, intimate where appropriate",
      "Combines process, philosophy, and personality",
      "NEXT STEPS",
      "Pending approval, we will schedule a kickoff call in July, visit the site before August, plan our first August shoot day, and begin the setup of time-lapse infrastructure. A draft production calendar and budget will be delivered following confirmation of scope.",
      "INVESTMENT",
      "We’ve outlined two investment tiers based on the desired project scope:",
      "Full Scope Package – $81,300 CAD",
      "Covers the entire project as outlined above, including all site visits, lo-fi updates, final documentary, time-lapse support, and B-roll delivery.",
      "Payable in monthly installments of $4,517 over 18 months.",
      "Lean Package – $",
      ",600 CAD",
      "A more compact version focused on",
      "site visits",
      "including 5 interviews",
      ", the final documentary",
      "and its corresponding",
      "social cutdowns, and time-lapse support.",
      "This package",
      "excludes",
      "the monthly updates and B-Roll library, focusing strictly on milestone documentation.",
      "Payable in 4 installments of $",
      "50 or custom payment schedule.",
      "These prices are based on preliminary planning and will be finalized with a detailed scope and timeline.",
      "Prepared by:",
      "Johnny Hockin and Nina Gilmour",
      "Juniper Islan",
      "This section outlines how we work—our systems for communication, delivery, budgeting, and client success.",
      "Our goals are to see our projects through with highly organized and pro-active client communication. To us, a successful project starts with clear objectives—and a shared creative vision between client and team from day one.",
      "We are always looking for a way to approximate the final product ahead of time to allow for feedback and signoff before we arrive on set, whether it’s clear scripts, rehearsals, running scenarios, or creating mock-ups. The worst thing that can happen to a project is that our client is surprised by the way things are delivered.",
      "This is why our projects all start with clear cut",
      "Statement of Work",
      "documents. These include a work schedule, key dates, a comprehensive list of deliverables, a budget breakdown, a pay schedule, and executed signatures so that we all know that we’re starting on the same page. It’s an important reference document as we move through the project, and has been invaluable in the rare case of any misunderstandings or conflicts.",
      "Creative Project Management",
      "Producer and head of operations Nina Gilmour leads project logistics with a focus on aligning timelines, on-camera subjects, and stakeholders to keep work moving smoothly and efficiently.",
      "Timeline Management",
      "We hold weekly internal standups and client check-ins as needed. We track all team hours using Harvest and have never required a major rescope due to budget overrun.",
      "Budget Accuracy",
      "We prepare detailed estimates and actualized budgets. Fair quoting and transparency are key to our sustainability and client trust.",
      "Our Interviews",
      "We’ve conducted thousands of interviews and pride ourselves on drawing out natural, engaging moments—even from subjects who aren’t used to being on camera. We carefully plan our setups and questions to create a relaxed atmosphere that encourages thoughtful, human responses. Our interviews take time, but that time is well spent: it’s how we capture material that cuts through and presents people in their best light.",
      "Rights & Legal",
      "We manage on camera appearance and location releases, music and footage licenses, and copyright clearances in-house or via vetted visual researchers when needed.",
      "Subcontractors",
      "We vet all external collaborators and handle all creative direction and paperwork. Clients remain protected and free from extra admin load.",
      "Infrastructure",
      "We own industry-standard camera, audio, and lighting gear, including a Sony FX6 package. All projects are securely backed up and delivered through pro tools like Frame.io and Vimeo Pro.",
      "We approach every project as a collaboration—not just a delivery. Your success is our creative metric.",
      "The Challenge",
      "– for Muskoka Roastery Coffee Co.",
      "A 15-minute branded documentary on Canada’s most extreme amateur canoe race. We followed teachers-turned-athletes who train for this overnight wilderness challenge—produced as a follow-up to our first successful film with the brand.",
      "Watch full film",
      "Social version",
      "Howling: The Call of the Wild",
      "– for Muskoka Roastery Coffee Co.",
      "An immersive documentary exploring the mystique of the Algonquin wolf and its significance to conservationists, scientists, and local Indigenous voices. Created to deepen the brand’s association with wilderness, connection, and introspection.",
      "Watch full film",
      "15-second cut",
      "2025/26 Season Trailer",
      "– for Toronto Symphony Orchestra",
      "We were engaged to create a series of trailers to support the TSO’s 2025/26 season launch, each tailored to different audiences and formats. This piece is the anchor trailer—emotive, cinematic, and built around Gustavo Gimeno’s personal reflections. Shorter, high-energy variations are forthcoming for broader public release.",
      "Watch full trailer",
      "Teaser",
      "Friendlier x Coca-Cola x Toronto Zoo",
      "A case study campaign capturing a first-of-its-kind reuse partnership at the Toronto Zoo, supported by Coca-Cola. We created four separate videos—from polished partnership storytelling to UGC-style explainers—tailored for vertical and horizontal formats. All content featured real guests, staff, and stakeholders, filmed on a single intensive production day.",
      "Watch partnership case study",
      "Meat Cute",
      "– for Subway Canada & Dentsu Creative",
      "A one-week turnaround Valentine’s campaign built around real blind dates, shot live inside an open Subway restaurant. We handled casting, filming, and post—balancing fly-on-the-wall intimacy with a cinematic finish. The campaign earned 10M+ views and 8M+ engagements.",
      "Campaign summary video"
    ],
    "images": [
      {
        "name": "image2.png",
        "size": 70,
        "path": "images/image2.png"
      },
      {
        "name": "image7.png",
        "size": 17481,
        "path": "images/image7.png"
      }
    ]
  },
  {
    "filename": "Juniper Island Prod - Dufferin County - Q2024 ED-24-02 - Photography and Videography Services.docx",
    "type": "docx",
    "text_content": [
      "1. Rily",
      "Rily.co is a recipe startup for people with health conditions and allergies. We’ve been their digital content vendor for 4 years on a rolling retainer. We produce and post 3-4 social media videos per week, regularly spotlighting diverse Ontarian chefs and recipe developers. We manage their team of nutritionists and recipe developers to creative direct the company’s content vision and oversee their social media content creation. In 4 years, we’ve grown",
      "their Instagram following",
      "from 150 to over 36,000 by producing engaging content that resonates with their audience. Our top performing content pieces have 3.9 million and 2 million views. The content is a mix of recipe videos and",
      "chef profiles",
      "2. Canadian Media Producers Association (CMPA)",
      "We started working with one of our longest standing clients, the Canadian Media Producers Association 8 years ago, when we created a brand sizzle video for them, which played a crucial role in their branding strategy. We did video and music editing, creative direction, animation, secured rights to footage/music, and facilitated a VO recording with Candy Palmater.",
      "View the most recent version here.",
      "Additionally, we design video signage for their annual Prime Time conference in Ottawa and edit their online event talks (20 videos annually).",
      "3. Red Bull Music Academy",
      "We worked with Red Bull’s Toronto office on music-focused content projects from 2012-2019. Over the years we helped create YouTube, social media and podcast content that spotlighted Canadian and Ontarian artists, for both a local and global audience as part of their music content plan.",
      "Youtube series",
      "Playing With…",
      "portrayed diverse Ontarian and Canadian musicians discovering new electronic instruments for the first time and experimenting with them.",
      "We created the podcast",
      "Northern Lights",
      "to tell documentary stories from Canada’s underground music scenes.",
      "We contributed stories to Red Bull’s Global Radio programs on Canadian artists.",
      "We created the",
      "Spaces",
      "YouTube short documentaries to tell stories of how Canadian artists were contending with the shifting landscape of concert venues and rehearsal halls",
      "We created social media campaigns",
      "Fortune Cookie Secrets",
      "Rorschach Test",
      "where diverse Ontarian artists played fun games on the Red Bull social media accounts.",
      "In 2019, Red Bull’s global strategy shifted away from music.",
      "4. Subway Canada -",
      "Click here to",
      "view the campaign summary video",
      "We partnered with Subway Canada and agency Dentsu Creative on a Valentine's Day campaign to create real-life romantic connections in a Subway restaurant. This project required rapid execution, filming, and post-production.",
      "Problem: Dentsu Creative approached us with a last-minute concept: staging blind dates in a Subway to spark genuine connections. We had 7 days for planning and shooting, and 5 days for post-production. The campaign needed to look cinematic yet candid, within the constraints of a small, operational Subway restaurant.",
      "Solution: We used compact Sony cameras and GoPros to capture multiple angles. We chose a table behind a pillar for privacy and optimal branding visibility, leveraging natural light. Under the creative direction of Johnny Hockin, we created an environment fostering authentic interactions, using open-ended questions to prompt natural dialogue.",
      "Execution: We filmed 12 dates over six hours and focused on editing for social media impact: intrigue, a strong opening, and fast cuts. We balanced the agency's need for meaningful communication with Subway's preference for a fun, punchy presentation.",
      "Result: We delivered two 15-second teasers and a 1:15 video. Within a day, the teasers reached 500,000 views on TikTok and Instagram, totaling 10 million views and 8 million engagements by week's end. The audience responded enthusiastically, engaging with the content like a reality dating show. The campaign's success led to further collaborations with Dentsu.",
      "5. Muskoka Roastery Coffee Company",
      "Muskoka Roastery Coffee Company is an Ontario-based coffee roastery in Huntsville. They hired us to create premium, short form documentaries for their YouTube channel in an effort to show their brand’s love of (and place in) the Canadian wilderness. For the first film, our budget was $60K CAD to create a 15-minute film and related social assets, with a potential shooting schedule of 7-14 days. After a careful research process, we settled on telling the story of the Algonquin Wolf. Its stillness, nobility, unique geographical relevance to the Roastery, as well as the intriguing scientific and Indigenous characters made it an interesting subject. We traveled around the province and collaborated with Magnetawan First Nation to tell the story.",
      "The film",
      "was well received, earning more than 56K organic views.",
      "The client was exceptionally happy and greenlit a second film about a 24-hour canoe race that takes place all day and night in Huntsville, with a fraction of the racers even finishing the race.. The province’s vibrant marathon canoe racing community cooperated with us and championed our film and helped us earn more than 250,000 views on the project, and we were invited to screen at the Paddling film festival.",
      "View Film.",
      "6. Toronto Pan Am Sports Centre",
      "The Toronto Pan Am Sports Centre recently hired us to create a 90-second branded content video surrounding their sustainability initiative during the 2024 Olympic Swim Trials. The project was a collaboration between TPASC, Intuitive AI (a tech company revolutionising recycling sorting with AI operated screens that indicate to consumers how to sort their waste) and Friendlier (an Ontario-based tech firm that has invented",
      "reusable",
      "takeaway containers for restaurants). The budget was tight on this project but we were keen to work on a project that aligned with our sustainability values and it was a great opportunity to collaborate with 3 local businesses doing important work for the environment. We took care of all things preproduction, including writing the script all the way to the final touches of audio and colour-correcting. All three clients were very happy with the project and we’ve already signed on to do 2 more campaigns with Friendlier."
    ],
    "images": []
  },
  {
    "filename": "University of Alberta - Tender Answers .docx",
    "type": "docx",
    "text_content": [
      "Company Overview",
      "For over a decade, Juniper Island Productions has been delivering high-quality video content that captivates and engages audiences. Founded by Johnny Hockin, who transitioned from a successful broadcast career at CTVBellMedia, our company leverages his extensive experience, creativity and creative network to craft compelling stories and top-tier productions. We have evolved into a lean yet powerful production powerhouse, adept at partnering with businesses, public institutions, and major advertising agencies. Our flexible and scalable approach ensures we meet the diverse and dynamic needs of our clients, delivering exceptional results every time.",
      "Company History",
      "When Juniper Island Productions was founded in 2012,",
      "Johnny Hockin had spent seven years at MTV Canada, where he hosted MTV News, created the show Movie Night, and produced hundreds of branded content segments for major brands like Nike, Apple, and Red Bull. For the first 7 years of Juniper Island Productions, Johnny partnered with Red Bull Canada and their Music Academy to cover independent music in Canada, creating content for RedBullTV, YouTube, and their podcast network. Additionally, he produced branded content videos with Vice Canada and their brand partners and developed marketing, corporate, and social media content for various tech and broadcast firms.",
      "In 2019, we partnered with Muskoka Roastery Coffee Company to produce docu-style films",
      "showcasing the",
      "Canadian wilderness roots of their product",
      ". These films garnered nearly 300,000 views and significantly boosted brand awareness (view them here:",
      "Howling",
      "The Challenge",
      "In 2020, Nina Gilmour joined the team as producer and together we began a long-term collaboration with Rily.co, a recipe startup catering to individuals with health conditions and allergies, producing monthly recipe videos and chef profiles. This partnership has resulted in a vast library of engaging content.",
      "You can view their",
      "Instagram profile",
      "and one of our favourite videos we’ve produced for them",
      "here",
      "Most recently, in February 2024, we produced the “",
      "Meat Cute",
      "” Subway Canada, in partnership with Dentsu Creative. The project was a series of blind dates in a Subway location in anticipation of Valentine’s Day. The spot was highly successful, garnering over 10M views and 8M engagements over Tik Tok and Instagram.",
      "Why Choose Us",
      "Juniper Island Productions is a lean, highly skilled team of creatives who excel at delivering top-tier productions efficiently and effectively. Our streamlined approach allows us to remain agile, move quickly, and handle major projects with professionalism, without the burden of extensive overheads. We are often hired because we’re very good at bringing high-quality results on tight budgets and timelines. We ensure fair compensation for our subcontractors and often collaborate with local crews, fostering strong local partnerships, managing costs, and maintaining high production standards.",
      "We are passionate about sustainability and dedicated to creating impactful content that resonates with our clients' values. Our certification with Bullfrog Power is only the beginning of our interest in the new energy economy, and our commitment to sustainability. It’s an area of interest, and we’re always looking for ways to learn more about the sector and help tell these stories.",
      "We recently acted as a media sponsor of the Toronto Pan Am Sports Centre’s Olympic swim trial event, helping them showcase their sustainability efforts in",
      "a brand video",
      "highlighting their sustainability partnerships.",
      "also understand the complexities",
      "of working with large organizations with several stakeholders. We recently created a series of videos for",
      "Toronto Metropolitan University for their two Image Arts Graduate Programs to help with enrollment and share with prospective students the value of the programs to the industry. View the",
      "Film Program Video",
      "and the",
      "Photo Program Video",
      "For the",
      "Canadian Media Producers Association, we",
      "serve as their preferred video vendor, we continue to deliver successful projects that meet their communication and promotional needs.",
      "Our Approach",
      "Our methodology focuses on three key points: communication, organization, and foresight. Johnny Hockin and Nina Gilmour, our leads, pride themselves on taking the time to build consensus among our project stakeholders early and often. This way we can be sure that everyone is on the same page as we move through the production process.",
      "This approach ensures smooth pre-production, shooting, and post-production, resulting in high-quality deliverables that meet or exceed our clients’ expectations.",
      "Our collaborations with universities, industry associations, and our work with agencies and their clients tend to have dozens of stakeholders, whose needs we have to balance carefully, and we pride ourselves on being able to thread the needle for them and see projects through effectively.",
      "Commitment to Impact",
      "Working with the University of Alberta aligns well with our interest in the future of the energy sector and our desire to support initiatives that can inspire and educate future generations on what our future looks like. We look forward to the opportunity to contribute to your innovative work.",
      "Watch our demo reel",
      "We operate with a nimble, highly skilled team adept at delivering high-quality video work efficiently and effectively. Our process allows us to be agile, respond quickly, and handle significant projects with the utmost professionalism, all while maintaining minimal overhead. We choose to work this way because we’ve found it’s the most effective way to deliver projects to our standards while staying on-budget and meeting timelines.",
      "In the event of personnel backup or replacement needs, our approach is designed to ensure continuity and quality:",
      "Lead Collaboration: Our leads, Johnny Hockin and Nina Gilmour, work closely as a pair, effectively covering for each other when needed. This collaboration ensures that there is always a senior team member available to oversee and manage the project, maintaining a high standard of delivery.",
      "Network of Contractors: We have a well-established network of creatives and subcontractors whom we regularly collaborate with, and which extends across the country including into Alberta. This network allows us to swiftly bring in the right talent to fill any roles as required, ensuring that project momentum is maintained without compromising quality.",
      "Fair Compensation and Local Collaboration: We believe in fair compensation for all our subcontractors and often work with local crews. This approach not only supports the local economy but also helps us manage costs effectively while upholding high production standards.",
      "Our nimble structure and network of reliable professionals are the key to our ability to manage and deliver projects successfully.",
      "Meat Cute",
      "- in partnership with Subway Canada & Dentsu Creative",
      "Watch the case study video -",
      "https://vimeo.com/938818301/c939bc7d4f?share=copy",
      "Problem",
      "Dentsu Creative got in touch with us at the end of January with a last minute idea for their client, Subway Canada for Valentine’s Day. Their ask: could we stage a series of blind dates in a Subway store and help people spark some IRL romantic connections? (IRL is internet-speak for “in real life”).",
      "They were looking for a partner who understood the social media landscape, and who could take care of everything, including finding a way to film it, building out the crew, and all the directing and storytelling including all aspects of post-production.",
      "We would have to film it 7 days later, and to release it by Valentine’s Day we would have to finish post-production 5 days after that. It was a tall order, but we loved the idea and we like a challenge.",
      "They wanted to make sure that the blind dates were real, candid, and hopefully led to authentic connections. They wanted it to look as cinematic and premium as possible, while also having a fly-on-the-wall feel. Given the size of most cinema cameras (large) and most Subway restaurants (small) we didn’t have much space to work with.",
      "Dentsu provided a street team and host to help us gather up the public and some simple romantic decorations, but the key to our success was going to be capturing the real emotional moments of our daters—and making it look good. With this in mind, we worked to roleplay every possible scenario ahead of time.",
      "Solution",
      "We immediately went down to the nearest Subway and began deciding on our creative solution. We would use smaller Sony cameras with documentary lenses, and capture 4 angles of the action, plus 2 installed GoPro cameras.",
      "The store had to remain open and we weren’t allowed to use any lights, so we chose a table behind a pillar, affording our daters some privacy that would help them open up to each other. This table also gave us a view of signage and posters that were important to the client, as well as the best possible natural backlighting coming through the window.",
      "Our creative director and director of this piece Johnny Hockin started his career as an interviewer at MTV Canada, and has conducted thousands of interviews in his career, so he has an understanding of the subtleties that are important for bringing people out of their shell on camera. In this case it largely meant staying out of their way and allowing natural things to happen. The best way we could encourage chemistry without meddling with our daters was to prompt them with open-ended questions on their subs (e.g. “what’s your love language?” or “if you could be any animal, what would you be?”).",
      "Once we had captured 12 dates over the course of 6 hours of shooting, we picked things up in the edit suite. We put together rough cuts that emphasized everything that a social media piece needs. And we advocated for these things throughout the process - intrigue, a strong opening, and fast paced cuts.",
      "Our biggest challenge at this point was the different needs of our stakeholders: the agency creative director was advocating for a piece that underlined the seriousness and importance of communicating in person. Meanwhile the Subway social team’s point of view was that it had to be fun, punchy, and controversial. We did everything we could to tick all the boxes while we deliberated as a group what the best path forward was. The Subway marketing team was a very effective arbitrator and as a result of the conversation and debate, we felt that the piece was made much better (fun, with a nod to the importance of IRL communication).",
      "Result",
      "By the end of our work, our favourite dates were cut into 2 x 15-second teaser videos to generate anticipation with the public, and 1 longer video (1:15) to pay off the campaign.",
      "View the social media post here -",
      "https://vimeo.com/951289585/bd9f4f0b43",
      "The results were almost immediate. Within a day of the teasers going up we saw views hit 500k each on the TikTok and Instagram posts. And after the smoke had cleared at the end of the week, the posts saw 10 Million views and over 8 Million engagements.",
      "Like a fun reality dating show, the audience connected with our characters, wanted to know more about them, and loved bantering about the dates. It was a major success, right in line with what Dentsu dreamed of when they pitched the idea, and with the sassy fun response that the Subway social media team was looking for.",
      "Dentsu was very pleased with the result, and further engaged us to create an asset to show for potential awards recognition. We have since worked with them again as a production partner.",
      "Howling: The Call of the Wild",
      "in partnership with Muskoka Roastery Coffee Co.",
      "Watch the Short doc (15m) -",
      "https://www.youtube.com/watch?v=FeGJw5FvMaA",
      "Social asset (15-second version) -",
      "https://vimeo.com/944520693/53f9168ab1",
      "Problem",
      "Muskoka Roastery Coffee Co. was interested in taking their brand storytelling up a level by releasing a branded documentary film that brought their customers more in touch with the Canadian wilderness roots of their product. While they roast their coffee in Muskoka, they sell it around the country and the world, and they had heard from their customers that a large part of their brand’s appeal was the way it stood for the beauty and stillness of the Canadian wilderness.",
      "Their coffee is well made, carefully roasted, and their hope was that it can take you to a place of oneness with nature, solitude and connectedness. They wanted a film that could demonstrate their brand by doing that for the viewers. A film that might help the viewer feel more connected to nature, and that might inspire them to get out and enjoy nature themselves.",
      "They tasked us with finding subjects for their film that might fit the bill, and gave us 6 months of research and end-to-end production time to come up with a film that fit this brief, as well as a number of social assets. While our budget was limited, as we had only $60,000CAD for the total project and a potential shooting schedule of 7-14 days, we had time to carefully prepare, and could build shoot days around various crew sizes, depending on the day’s needs.",
      "The roastery’s measures of success were that they wanted the film to resonate with their core audience and their Huntsville community and employees, and they wanted the film to help their brand perception and awareness around the country as they prepared to move towards global distribution.",
      "Solution",
      "We spoke with over a hundred potential subjects, relating to 14 different topic storylines before settling on the Algonquin Wolf. The wolf’s embodiment of the stillness and nobility of the wilderness, its unique geographical relevance to the Roastery, and the intriguing scientific and Indigenous characters made it interesting to us and the client.",
      "We worked closely with the client at every stage to select our stories and our approaches, providing them with research reports, storyboards, scripts, and cuts to comment on. The only way we were able to earn the creative freedom we needed to complete the project on budget was to give them as many chances as possible to weigh in and make them heard.",
      "We worked with Waaseyaa Consulting’s Christina Luckasavitch, an Indigenous consultant who lives right in the wolves’ territory. She introduced us to well-known local naturalist Michael Runtz, who is one of the core subjects of the film. She also helped us collaborate with the Magnetawan First Nation, whose conservation activities around turtles are well known, and whose territory overlaps with the wolves. Their elders agreed to lend their time and knowledge to the project in exchange for some archival video work.",
      "We worked with cinematographer Jack Yan Chen, a huge fan of the Canadian outdoors, to capture the look and feel of the piece - as immersive as we could, transporting the viewer into the bush, with teams as small at times as 2 people, at times as many as 8, hiking as much as 90 minutes into the back woods to capture our material.",
      "One central problem of the film as it was coming together was that a large part of the relationship that locals have with the animals are the wolf howls that have been on pause for years (in large part due to COVID-19). Hundreds of people would gather late afternoon into the evening and howl into the air, led by naturalists like Michael Runtz. Our solution for this was to help dramatize one of Michael’s private wolf howls—the same thing can be conducted by private groups, and we sent a local family with Michael to learn how to howl and investigate whether they could communicate with the wolves by howling.",
      "Result",
      "By the end of our 6-month timeline, the film was completed and released to the public, along with 6 social assets, including a 15 second version. The client was exceptionally happy with it, and greenlit another budget for us to film our runner up idea (a film about a 24-hour canoe race).",
      "The film was well received by the public, earning more than 50,000 organic views in a 3-month period, and increasing engagement on MRCC’s social channels.  The follow-up film received 250,000 views and another round of positive feedback from the public, marking a successful campaign around the 2 films, and preparing MRCC for their brand positioning as they moved into global sales.",
      "Spaces: Montreal",
      "Spaces: Vancouver",
      "in partnership with Red Bull Music Academy Canada",
      "Watch the 4-minute mini-doc:",
      "https://vimeo.com/396733644",
      "Problem",
      "Red Bull Canada’s media team was looking for content for the brand’s international YouTube Channel for music and their Music section of their website. They reached out to the journalists and producers that they had worked with before to take in pitches that could portray uniquely Canadian stories that their global audience would respond to.",
      "They wanted to profile Canadian musical artists, but for the documentary shorts to be more than simply a profile: they wanted them to spotlight a story or trend in the arts scene and music industry that was defining the current moment. They also had mandates for diversity and inclusion that they wanted fulfilled by the work.",
      "Our creative director Johnny Hockin had been working with Canadian-based artists as part of the Red Bull Music Academy team in Toronto, producing radio shows, podcasts, and video projects for the YouTube channel. Given this opportunity to pitch, he reached out to a number of artists in his network to find out what issues and stories were resonating with them.",
      "One of the most interesting issues was around artistic spaces. Venues were shutting down, practice spaces and artistic spaces were becoming less and less viable, but Canadian artists were persevering and finding ways to make it work for them. This story of determination in the face of adversity played out in cities across the country, and was tied to some of the strongest and most powerful artists, and made a natural pitch.",
      "Red Bull Canada was excited by the proposal and greenlit us for a 6-month production period, from pre- to post-production, with a budget of $50,000 for two films, one in Vancouver and one in Montreal.",
      "Solution",
      "Researching local artists, we identified compelling stories of artists persevering despite these challenges. This included internet radio stations and record labels run out of loft spaces, popular nightlife events that used cultural centres and underused community space, and artists sharing studio spaces with each other in their homes.",
      "We pre-interviewed potential subjects and prepared them for inclusion, and then collaborated with Red Bull’s team as a type of jury to score potential candidates, measuring the strength of their story, their artistic output, the visual interest of their space, and their ability to be comfortable on camera.",
      "Once we’d confirmed our subjects, we assembled small production crews of locals in each city, and made the most of our limited shoot days to achieve a cohesive story. We used young cinematographers, sound recordists, some of whom have had careers blossom in the years since we worked with them.",
      "Documentary style shooting has its challenges, for instance in some cases despite our planning, the unexpected would come up - a space not being available anymore, or natural light simply not agreeing with us. But we maintained regular communication with Red Bull Canada's media team, sending shoot reports and planning for backup material in case of difficulty.",
      "Because some of our subjects were concerned about the precarity of their spaces, we had to film them discreetly and secretly, in a way where we wouldn’t give away their location, which was an interesting wrinkle. Red Bull’s initial desire was to shine a light on these spaces, and perhaps even “make them famous”—but our team advocated for listening to the artist’s wishes in the name of bettering the story. Mystery and intrigue usually make for more compelling narratives. The brand eventually agreed with our take, and it helped to make the pieces stronger.",
      "At the end of a summer of shoots, we delivered the 2 pieces on time and on budget.",
      "Result",
      "Spaces",
      "mini docs appeared on the Red Bull Music global YouTube channel as well as teasers and short forms on Instagram, Facebook and Twitter. The brand was so happy with the assets that they chose to later re-use the Montreal pieces as promotional material for the Red Bull Music Academy festival which took place in Montreal the following year.",
      "After the project was complete we had delivered more than 20 different assets, and earned over 800k views across all platforms.",
      "Our team continued to work successfully with Red Bull Music for another year until the global brand mandate changed to downplay music content and focus on sports and e-sports.",
      "Our goal with our projects is to see them through with highly-organized and proactive communication with our clients. To us, a successful project involves clear objectives that the client and team are aligned on going in.",
      "We are always looking to approximate the final product ahead of time and allow for feedback and signoff before we arrive on set, whether it’s clear scripts, rehearsals, running scenarios, or creating mock-ups. The worst thing that can happen to a project is that our client is surprised by the way things are delivered.",
      "This is why our projects all start with clear cut",
      "Statement of Work",
      "documents. These include a work schedule, key dates, a comprehensive list of deliverables, a budget breakdown, a pay schedule, and executed signatures so that we all know that we’re starting on the same page. It’s an important reference document as we move through the project, and has been invaluable in the rare case of any misunderstandings or conflicts.",
      "Producer Nina Gilmour was a trained actor and theatre producer before joining the team, and has worked professionally in the arts her whole career. She is extremely adept at organizing projects and working to help all kinds of personalities and points of view to get aligned and to see things through in a timely and efficient manner.",
      "With a project like the Energy Transition sample campaign, we would begin with",
      "meeting with",
      "key stakeholders from the University’s team to fully understand the messaging needs of the campaign. From here, our goals are to fulfill that messaging",
      "target",
      "and hit and exceed your KPIs, on time and on budget.",
      "Style",
      "We will draw from our strengths in social media video storytelling in particular to hit the KPI goals of this project, focusing on",
      "visual and",
      "storytelling",
      "intrigue",
      "strong opening",
      ", and",
      "fast cuts",
      "to capture audience’s attention and send the right messages.",
      "Motion graphics",
      "heighten the production value and help keep audience engagement high as the video unfolds.",
      "The university’s energy transition efforts are exemplary of the school’s place on the cutting edge of technology, so the look and feel of the video would likely reflect this, by showing off the state of the art facilities, the high calibre talent, and the",
      "sizable",
      "impact of the innovation.",
      "We’d want a slick look that captures the attention, and a heightened lighting style to emphasize that this is not your average university department video, because this is not your average university department. This is cutting edge science that is doing its part to save the world.",
      "These are some starting point ideas, but our stylistic considerations will always take into account the client-side desires and the look and feel of the brands in play.",
      "Preproduction",
      "Starting from our stakeholder interviews, we then work to build out first draft scripts and",
      "shot",
      "lists, identifying what we think are the best ways to tell that story and make sure that it’s as interesting as possible to the audience. Then we work with your key stakeholders to develop these ideas, because even though we advocate for the interest and audience impact, we have to balance it carefully with our clients’ needs and they know their domain best. Once the client team has signed off on the creative direction that we propose, we begin the work to plan our filming.",
      "We’d work with the client team to",
      "identify and secure locations that reflect the University’s energy transition research and innovation. We’d use high-quality cameras (Arri Alexa Mini or Sony FX6) and supporting gear (e.g., drones, stabilizers) to capture cinematic footage, and we’d storyboard to plan and prepare for motion graphics that fit into our shots in eye-catching and unique ways.",
      "Scheduling",
      ": Develop a detailed shooting schedule to maximize efficiency, minimizing disruption to University operations.",
      "Permits",
      ": Obtain necessary permits for all locations.",
      "Storyboard and Script",
      ": Create a detailed storyboard and script, focusing on the narrative flow and key messages.",
      "Production Design",
      ": Pre-",
      "esign where possible any props and graphics that align with the University’s brand and the campaign's tone.",
      "Production",
      "Filming",
      ": Execute the shoot according to the schedule, capturing all necessary footage. We like to work in lean teams with as many people as we need and no more, so we would likely adapt our crew size per-day to keep things as efficient as possible.",
      "Interviews",
      ": Our director and cinematographer Johnny Hockin started his career as an interviewer, and has conducted thousands of interviews in his career, so he has an understanding of the subtleties that are important for bringing people out of their shell on camera. His specialty includes getting non-actors to appear confident and natural on camera.",
      "Where possible in interviews, voiceovers, and b-roll, we like to get options on the day to allow us flexibility in the edit room to continue to craft the storytelling as we edit.",
      "Post-Production",
      "Editing",
      ": Edit footage to create a cohesive and engaging narrative.",
      "Graphics and Animation",
      ": Add graphical elements and animations to",
      "increase viewer comprehension and engagement.",
      "Sound Design",
      ": Integrate background scores and sound effects to elevate the viewing experience. We like to add sound effects to our work to bring the feel of a larger-budget commercial production.",
      "Colour Grading",
      ": Apply colour correction and grading to ensure visual consistency and professionalism, and also to emphasize the creative look.",
      "We have years of experience delivering captions via burn-in as well as",
      "English and French SRT files for accessibility and compliance.",
      "Team member Nina Gilmour is fully bilingual and is an experienced translator.",
      "Contracting",
      ": We",
      "andle all contracts and agreements to ensure legal compliance.",
      "Managing Talent",
      "We can coordinate all members of the University staff and public as they prepare to make appearances in videos. We know how to prepare them, coach them, and make sure that we’ve secured their legal permission to use the video.",
      "We have worked with non-union actors as well as on ACTRA projects, and we are in good standing with the union. Even on non-union projects, we have clear contracts and agreements that we use with featured artists and people appearing on-screen that cover all necessary rights issues to legally protect our clients and projects.",
      "We have experience coordinating with talent managers or representatives for scheduling and logistics, and we work to ensure a respectful and professional on-set environment for all talent.",
      "Intellectual Property Rights",
      "We always obtain necessary releases and permissions for on-screen talent, locations, and archival footage. We have access to extensive music and stock footage libraries, and always obtain legal clearance for any copyrighted material used above and beyond our library access.",
      "We have worked on a number of complex projects involving the use of extensive archival and personal footage, and in those cases, we have collaborated with freelance visual researchers to help us find and clear the rights to everything the project requires. Visual researchers have contacts in various archives and discounts at all of the footage-licensing libraries, and take care of all of the legal and organizational aspects to a project.",
      "Managing Subcontractors",
      "We have a network of regular collaborators that we work with. In all cases, we conduct thorough vetting and selection processes for subcontractors. In most cases, we handle all of the client-facing creative direction, and bring on help with execution, so most of our clients will not have to deal with any added administration or tasks with respect to other collaborators. In the rare case that a client project needs creative talents that we don’t offer (e.g. particularly stylized stills photography), we are transparent with our clients and let them weigh in and help choose before we hire talent.",
      "We always established clear deal memos and/or scope of work agreements with subcontractors to make sure that there are no rights issues or misunderstandings.",
      "Project Management Approach",
      "Our team is lean and professional, so you can count on us to be your dedicated project managers to oversee the project from start to finish. We’re always reachable and happy to re-align, whatever comes up.",
      "Team Assets",
      "Our studio has an extensive amount of gear, including a Sony FX6 camera, professional lenses, lighting equipment, and audio equipment. This can give us great pricing flexibility.",
      "We use the Adobe suite as well as Davinci Resolve for our projects, but also have experience using Final Cut Pro and Avid. We have professional Vimeo and Google Drive and Frame.io accounts to help us deliver projects to clients and to allow client review of projects securely.",
      "All of our projects are minimum double-backed-up in secure hard drive storage, including all assets, footage and project files. If, at a later date, a project needs to come out of the archive, we will have it at the ready.",
      "Conclusion",
      "Our comprehensive approach is built to help ensure that the Energy Transition video will be produced efficiently, within budget, and to the highest quality standards. We are committed to working closely with the University to meet all requirements and deliver a video that effectively communicates the University's leadership in energy transition.",
      "Pricing Breakdown",
      "You will find attached an insurance certificate in our name made out to the University with Intact Insurance Company via Front Row Insurance Brokers, Inc. We’ve also attached a letter from our broker confirming our status and our account in good standing, allowing us to increase our coverage at any time to meet your needs.",
      "While our current coverage is below the limits required by the submission, we regularly increase our insurance coverages to meet the needs of larger projects, and will be happy to do so in the event that the University decides to engage us as an approved resource.",
      "Sincerely,",
      "Johnny Hockin",
      "Juniper Island Productions",
      "To whom it may concern,",
      "Re: Clearance Letter from Workers’ Compensation Board of Alberta",
      "We are writing to inform you that Juniper Island Productions does not currently operate in Alberta, and as such, we do not have a Workers’ Compensation Board (WCB) account in Alberta at this time.",
      "However, we are fully committed to complying with all necessary regulations to ensure the safety and protection of our contractors. Should the University of Alberta decide to engage Juniper Island Productions as an approved resource, we will promptly open an account with the Workers’ Compensation Board of Alberta and secure the necessary insurance coverage to protect our Albertan contractors.",
      "We appreciate your understanding and look forward to the opportunity to work with you.",
      "Sincerely,",
      "Johnny Hockin",
      "Juniper Island Productions"
    ],
    "images": [
      {
        "name": "image2.png",
        "size": 17481,
        "path": "images/image2.png"
      },
      {
        "name": "image3.png",
        "size": 727323,
        "path": "images/image3.png"
      }
    ]
  },
  {
    "filename": "Juniper Island Prod - 2024 Digital VOR - Question 2-2-1 - rfx_17642.docx",
    "type": "docx",
    "text_content": [
      "Juniper Island Productions - Question 2.2.1",
      "Q: *Provide a list of no fewer, and no more, than five (5) Ontario- and/or Canada-based clients, with descriptions (up to 200 words each), of the client and project of Branded Digital Content your organization produced in the past 5 years. Indicate if the content created was for a domestic (including Indigenous and multicultural) or international initiative.",
      "1. Rily",
      "Rily.co is a recipe startup for people with health conditions and allergies. We’ve been their digital content vendor for 4 years on a rolling retainer. We produce and post 3-4 social media videos per week, regularly spotlighting diverse Ontarian chefs and recipe developers. We manage their team of nutritionists and recipe developers to creative direct the company’s content vision and oversee their social media content creation. In 4 years, we’ve grown",
      "their Instagram following",
      "from 150 to over 36,000 by producing engaging content that resonates with their audience. Our top performing content pieces have 3.9 million and 2 million views. The content is a mix of recipe videos and",
      "chef profiles",
      "2. Red Bull Canada",
      "We worked with Red Bull’s Toronto office on music-focused content projects from 2012-2018. Over the years we helped create YouTube, social media and podcast content that spotlighted Canadian and Ontarian artists, for both a local and global audience as part of their music content plan.",
      "Youtube series",
      "Playing With…",
      "portrayed diverse Ontarian and Canadian musicians discovering new electronic instruments for the first time and experimenting with them.",
      "We created the podcast",
      "Northern Lights",
      "to tell documentary stories from Canada’s underground music scenes.",
      "We contributed stories to Red Bull’s",
      "Global Radio programs on Canadian artists.",
      "We created the",
      "Spaces",
      "YouTube short documentaries to tell stories of how Canadian artists were contending with the shifting landscape of concert venues and rehearsal halls",
      "We created social media campaigns",
      "Fortune Cookie Secrets",
      "Rorschach Test",
      "where diverse Ontarian artists played fun games on the Red Bull social media accounts.",
      "In 2018, Red Bull’s global strategy shifted away from music.",
      "3. Muskoka Roastery Coffee Co.",
      "Muskoka Roastery is an Ontario-based coffee roastery in Huntsville. They hired us to create premium, short form documentaries for their YouTube channel in an effort to show their brand’s love of (and place in) the Canadian wilderness. For the first film, our budget was $60K CAD to create a 15-minute film and related social assets, with a potential shooting schedule of 7-14 days. After a careful research process, we settled on telling the story of the Algonquin Wolf. Its stillness, nobility, unique geographical relevance to the Roastery, as well as the intriguing scientific and Indigenous characters made it an interesting subject. We traveled around the province and collaborated with Magnetawan First Nation to tell the story.",
      "The film",
      "was well received, earning more than 56K organic views.",
      "The client was exceptionally happy and greenlit a second film about a 24-hour canoe race that takes place all day and night in Huntsville, with a fraction of the racers even finishing the race.. The province’s vibrant marathon canoe racing community cooperated with us and championed our film and helped us earn more than 250,000 views on the project, and we were invited to screen at the Paddling film festival.",
      "View Film.",
      "4. Toronto Pan Am Sports Centre",
      "The Toronto Pan Am Sports Centre recently hired us to create a 90-second branded content video surrounding their sustainability initiative during the 2024 Olympic Swim Trials. The project was a collaboration between TPASC, Intuitive AI (a tech company revolutionizing recycling sorting with AI operated screens that indicate to consumers how to sort their waste) and Friendlier (an Ontario-based tech firm that has invented",
      "reusable",
      "takeaway containers for restaurants). The budget was tight on this project but we were keen to work on a project that aligned with our sustainability values and it was a great opportunity to collaborate with 3 local businesses doing important work for the environment. We took care of all things preproduction, including writing the script all the way to the final touches of audio and colour-correcting. All three clients were very happy with the project and we’ve already signed on to do 2 more campaigns with Friendlier.",
      "5. Canadian Media Producers Association (CMPA)",
      "We started working with one of our longest standing clients, the Canadian Media Producers Association 8 years ago, when we created a brand sizzle video for them, which played a crucial role in their branding strategy. We did video and music editing, creative direction, animation, secured rights to footage/music, and facilitated a VO recording with Candy Palmater.",
      "View the most recent version here.",
      "Additionally, we design video signage for their annual Prime Time conference in Ottawa and edit their online event talks (20 videos annually).",
      "Juniper Island Productions - Question 2.3.1",
      "Q: Describe the best Branded Digital Content work example your company created directly with a client in the last 5 years that demonstrates your ability to develop and execute relevant, impactful, fully produced channel-specific digital content, particularly for social media, to meet a defined client need. Provide examples / images of the final creative you produced.",
      "Meat Cute",
      "- in partnership with Subway Canada & Dentsu Creative",
      "Problem",
      "Dentsu Creative got in touch with us at the end of January with a last minute idea for their client, Subway Canada for Valentine’s Day. Their ask: could we stage a series of blind dates in a Subway store and help people spark some IRL romantic connections? (IRL is internet-speak for “in real life”).",
      "They were looking for a partner who understood the social media landscape, and who could take care of everything, including finding a way to film it, building out the crew, and all the directing and storytelling including all aspects of post-production.",
      "We would have to film it 7 days later, and to release it by Valentine’s Day we would have to finish post-production 5 days after that. It was a tall order, but we loved the idea and we like a challenge.",
      "They wanted to make sure that the blind dates were real, candid, and hopefully led to authentic connections. They wanted it to look as cinematic and premium as possible, while also having a fly-on-the-wall feel. Given the size of most cinema cameras (large) and most Subway restaurants (small) we didn’t have much space to work with.",
      "Dentsu provided a street team and host to help us gather up the public and some simple romantic decorations, but the key to our success was going to be capturing the real emotional moments of our daters—and making it look good. With this in mind, we worked to roleplay every possible scenario ahead of time.",
      "Solution",
      "We immediately went down to the nearest Subway and began deciding on our creative solution. We would use smaller Sony cameras with documentary lenses, and capture 4 angles of the action, plus 2 installed GoPro cameras.",
      "The store had to remain open and we weren’t allowed to use any lights, so we chose a table behind a pillar, affording our daters some privacy that would help them open up to each other. This table also gave us a view of signage and posters that were important to the client, as well as the best possible natural backlighting coming through the window.",
      "Our creative director and director of this piece Johnny Hockin started his career as an interviewer at MTV Canada, and has conducted thousands of interviews in his career, so he has an understanding of the subtleties that are important for bringing people out of their shell on camera. In this case it largely meant staying out of their way and allowing natural things to happen. The best way we could encourage chemistry without meddling with our daters was to prompt them with open-ended questions on their subs (e.g. “what’s your love language?” or “if you could be any animal, what would you be?”).",
      "Once we had captured 12 dates over the course of 6 hours of shooting, we picked things up in the edit suite. We put together rough cuts that emphasized everything that a social media piece needs. And we advocated for these things throughout the process - intrigue, a strong opening, and fast paced cuts.",
      "Our biggest challenge at this point was the different needs of our stakeholders: the agency creative director was advocating for a piece that underlined the seriousness and importance of communicating in person. Meanwhile the Subway social team’s point of view was that it had to be fun, punchy, and controversial. We did everything we could to tick all the boxes while we deliberated as a group what the best path forward was. The Subway marketing team was a very effective arbitrator and as a result of the conversation and debate, we felt that the piece was made much better (fun, with a nod to the importance of IRL communication).",
      "Result",
      "By the end of our work, our favourite dates were cut into 2 x 15-second teaser videos to generate anticipation with the public, and 1 longer video (1:15) to pay off the campaign.",
      "View the social media post here -",
      "https://vimeo.com/951289585/bd9f4f0b43",
      "The results were almost immediate. Within a day of the teasers going up we saw views hit 500k each on the TikTok and Instagram posts. And after the smoke had cleared at the end of the week, the posts saw 10 Million views and over 8 Million engagements.",
      "Like a fun reality dating show, the audience connected with our characters, wanted to know more about them, and loved bantering about the dates. It was a major success, right in line with what Dentsu dreamed of when they pitched the idea, and with the sassy fun response that the Subway social media team was looking for.",
      "Dentsu was very pleased with the result, and further engaged us to create an asset to show for potential awards recognition. We have since worked with them again as a production partner.",
      "Creative",
      "View the campaign summary video -",
      "https://vimeo.com/938818301/c939bc7d4f?share=copy",
      "Juniper Island Productions - Question 2.3.2",
      "Q: Describe the 2nd best work example your company created directly with a client in the last 5 years that demonstrates your ability to develop and execute relevant, impactful, fully produced channel-specific digital content, particularly for social media to meet a defined client need. Provide examples / images of the final creative you produced.",
      "Howling: The Call of the Wild",
      "in partnership with Muskoka Roastery Coffee Co.",
      "Problem",
      "Muskoka Roastery Coffee Co. was interested in taking their brand storytelling up a level by releasing a branded documentary film that brought their customers more in touch with the Canadian wilderness roots of their product. While they roast their coffee in Muskoka, they sell it around the country and the world, and they had heard from their customers that a large part of their brand’s appeal was the way it stood for the beauty and stillness of the Canadian wilderness.",
      "Their coffee is well made, carefully roasted, and their hope was that it can take you to a place of oneness with nature, solitude and connectedness. They wanted a film that could demonstrate their brand by doing that for the viewers. A film that might help the viewer feel more connected to nature, and that might inspire them to get out and enjoy nature themselves.",
      "They tasked us with finding subjects for their film that might fit the bill, and gave us 6 months of research and end-to-end production time to come up with a film that fit this brief, as well as a number of social assets. While our budget was limited, as we had only $60,000CAD for the total project and a potential shooting schedule of 7-14 days, we had time to carefully prepare, and could build shoot days around various crew sizes, depending on the day’s needs.",
      "The roastery’s measures of success were that they wanted the film to resonate with their core audience and their Huntsville community and employees, and they wanted the film to help their brand perception and awareness around the country as they prepared to move towards global distribution.",
      "Solution",
      "We spoke with over a hundred potential subjects, relating to 14 different topic storylines before settling on the Algonquin Wolf. The wolf’s embodiment of the stillness and nobility of the wilderness, its unique geographical relevance to the Roastery, and the intriguing scientific and Indigenous characters made it interesting to us and the client.",
      "We worked closely with the client at every stage to select our stories and our approaches, providing them with research reports, storyboards, scripts, and cuts to comment on. The only way we were able to earn the creative freedom we needed to complete the project on budget was to give them as many chances as possible to weigh in and make them heard.",
      "We worked with Waaseyaa Consulting’s Christina Luckasavitch, an Indigenous consultant who lives right in the wolves’ territory. She introduced us to well-known local naturalist Michael Runtz, who is one of the core subjects of the film. She also helped us collaborate with the Magnetawan First Nation, whose conservation activities around turtles are well known, and whose territory overlaps with the wolves. Their elders agreed to lend their time and knowledge to the project in exchange for some archival video work.",
      "We worked with cinematographer Jack Yan Chen, a huge fan of the Canadian outdoors, to capture the look and feel of the piece - as immersive as we could, transporting the viewer into the bush, with teams as small at times as 2 people, at times as many as 8, hiking as much as 90 minutes into the back woods to capture our material.",
      "One central problem of the film as it was coming together was that a large part of the relationship that locals have with the animals are the wolf howls that have been on pause for years (in large part due to COVID-19). Hundreds of people would gather late afternoon into the evening and howl into the air, led by naturalists like Michael Runtz. Our solution for this was to help dramatize one of Michael’s private wolf howls—the same thing can be conducted by private groups, and we sent a local family with Michael to learn how to howl and investigate whether they could communicate with the wolves by howling.",
      "Result",
      "By the end of our 6-month timeline, the film was completed and released to the public, along with 6 social assets, including a 15 second version. The client was exceptionally happy with it, and greenlit another budget for us to film our runner up idea (a film about a 24-hour canoe race).",
      "The film was well received by the public, earning more than 50,000 organic views in a 3-month period, and increasing engagement on MRCC’s social channels.  The follow-up film received 250,000 views and another round of positive feedback from the public, marking a successful campaign around the 2 films, and preparing MRCC for their brand positioning as they moved into global sales.",
      "Creative",
      "Watch the Short doc (15m) -",
      "https://www.youtube.com/watch?v=FeGJw5FvMaA",
      "Social asset (15-second version) -",
      "https://vimeo.com/944520693/53f9168ab1",
      "Juniper Island Productions - Question 2.3.3",
      "Q: Describe the 3rd best work example your company created directly with a client in the last 5 years that demonstrates your ability to develop and execute relevant, impactful, fully produced channel-specific digital content, particularly for social media to meet a defined client need. Provide examples / images of the final creative you produced.",
      "Spaces: Montreal",
      "Spaces: Vancouver",
      "in partnership with Red Bull Music Academy Canada",
      "Problem",
      "Red Bull Canada’s media team was looking for content for the brand’s international YouTube Channel for music and their Music section of their website. They reached out to the journalists and producers that they had worked with before to take in pitches that could portray uniquely Canadian stories that their global audience would respond to.",
      "They wanted to profile Canadian musical artists, but for the documentary shorts to be more than simply a profile: they wanted them to spotlight a story or trend in the arts scene and music industry that was defining the current moment. They also had mandates for diversity and inclusion that they wanted fulfilled by the work.",
      "Our creative director Johnny Hockin had been working with Canadian-based artists as part of the Red Bull Music Academy team in Toronto, producing radio shows, podcasts, and video projects for the YouTube channel. Given this opportunity to pitch, he reached out to a number of artists in his network to find out what issues and stories were resonating with them.",
      "One of the most interesting issues was around artistic spaces. Venues were shutting down, practice spaces and artistic spaces were becoming less and less viable, but Canadian artists were persevering and finding ways to make it work for them. This story of determination in the face of adversity played out in cities across the country, and was tied to some of the strongest and most powerful artists, and made a natural pitch.",
      "Red Bull Canada was excited by the proposal and greenlit us for a 6-month production period, from pre- to post-production, with a budget of $50,000 for two films, one in Vancouver and one in Montreal.",
      "Solution",
      "Researching local artists, we identified compelling stories of artists persevering despite these challenges. This included internet radio stations and record labels run out of loft spaces, popular nightlife events that used cultural centres and underused community space, and artists sharing studio spaces with each other in their homes.",
      "We pre-interviewed potential subjects and prepared them for inclusion, and then collaborated with Red Bull’s team as a type of jury to score potential candidates, measuring the strength of their story, their artistic output, the visual interest of their space, and their ability to be comfortable on camera.",
      "Once we’d confirmed our subjects, we assembled small production crews of locals in each city, and made the most of our limited shoot days to achieve a cohesive story. We used young cinematographers, sound recordists, some of whom have had careers blossom in the years since we worked with them.",
      "Documentary style shooting has its challenges, for instance in some cases despite our planning, the unexpected would come up - a space not being available anymore, or natural light simply not agreeing with us. But we maintained regular communication with Red Bull Canada's media team, sending shoot reports and planning for backup material in case of difficulty.",
      "Because some of our subjects were concerned about the precarity of their spaces, we had to film them discreetly and secretly, in a way where we wouldn’t give away their location, which was an interesting wrinkle. Red Bull’s initial desire was to shine a light on these spaces, and perhaps even “make them famous”—but our team advocated for listening to the artist’s wishes in the name of bettering the story. Mystery and intrigue usually make for more compelling narratives. The brand eventually agreed with our take, and it helped to make the pieces stronger.",
      "At the end of a summer of shoots, we delivered the 2 pieces on time and on budget.",
      "Result",
      "Spaces",
      "mini docs appeared on the Red Bull Music global YouTube channel as well as teasers and short forms on Instagram, Facebook and Twitter. The brand was so happy with the assets that they chose to later re-use the Montreal pieces as promotional material for the Red Bull Music Academy festival which took place in Montreal the following year.",
      "After the project was complete we had delivered more than 20 different assets, and earned over 800k views across all platforms.",
      "Our team continued to work successfully with Red Bull Music for another year until the global brand mandate changed to downplay music content and focus on sports and e-sports.",
      "Creative",
      "Watch the 4-minute mini-doc:",
      "https://vimeo.com/396733644",
      "Juniper Island Productions - Question 2.3.4",
      "Q: Provide an explanation of your project, production and budget management processes. Include timelines, budgets/financial management, talent management, partners, sub-contractors and intellectual property rights (if applicable).",
      "Project, Production and Budget Management Processes",
      "Our goals with our projects are to see them through with highly organized and proactive communication with our clients. To us, a successful project involves clear objectives and that the client and team are aligned on going in.",
      "We are always looking for a way to approximate the final product ahead of time and allow for feedback and signoff before we arrive on set, whether it’s clear scripts, rehearsals, running scenarios, or creating mock-ups. The worst thing that can happen to a project is that our client is surprised by the way things are delivered.",
      "This is why our projects all start with clear cut",
      "Statement of Work",
      "documents. These include a work schedule, key dates, a comprehensive list of deliverables, a budget breakdown, a pay schedule, and executed signatures so that we all know that we’re starting on the same page. It’s an important reference document as we move through the project, and has been invaluable in the rare case of any misunderstandings or conflicts.",
      "Producer Nina Gilmour was a trained actor and theatre producer before joining the team, and has worked professionally in the arts her whole career. She is extremely adept at organizing projects and working to help all kinds of personalities and points of view to get aligned and to see things through in a timely and efficient manner.",
      "Managing Timelines",
      "We have weekly internal standup meetings to go over project statuses and orient ourselves each week within our project timelines. We do the same externally with many of our clients, especially on larger projects or with long-term clients.",
      "We believe in standing by our word, and we’re proud to say that we have never had a project require a major redefinition of scope due to miscommunication or delivery issues. All of our team’s time is tracked with a software called Harvest, and we are committed to being as proactive as possible with our client communication.",
      "Managing Budgets",
      "We create detailed budget breakdowns at the pitch stage for all our production costs internal and external (crew, equipment, travel, etc.), and we convert this to a working budget during the project, and an actualized final budget post project. As a young business less than 10 years in, it’s important to us to fairly and accurately quote work to our clients, and to watch our profitability and ability to pay our teams fairly.",
      "Managing Talent",
      "We have worked with non-union actors as well as on ACTRA projects, and we are in good standing with the union. Even on non-union projects, we have clear contracts and agreements that we use with featured artists and on-screen talent that cover all necessary rights issues to legally protect our clients and projects.",
      "We have experience coordinating with talent managers or representatives for scheduling and logistics, and we work to ensure a respectful and professional on-set environment for all talent.",
      "Our creative director Johnny Hockin has worked with just about every type of on-camera personality, having started his career as a broadcast personality himself, interviewing film stars and political figures, and moving to directing actors of all levels of experience.",
      "He is also good at getting relaxed and natural performances out of non-actors, whether it’s a business leader speaking about their upcoming product or a regular family embarking on an adventure.",
      "Intellectual Property Rights",
      "We always obtain necessary releases and permissions for on-screen talent, locations, and archival footage. We have access to extensive music and stock footage libraries, and always obtain legal clearance for any copyrighted material used above and beyond our library access.",
      "We have worked on a number of complex projects involving the use of extensive archival and personal footage, and in those cases, we have collaborated with freelance visual researchers to help us find and clear the rights to everything the project requires. Visual researchers have contacts in various archives and discounts at all of the footage-licensing libraries, and take care of all of the legal and organizational sides.",
      "Managing Subcontractors",
      "We have a network of regular collaborators that we work with. In all cases, we conduct thorough vetting and selection processes for subcontractors. In most cases, we handle all of the client-facing creative direction, and bring on help with execution, so most of our clients will not have to deal with any added administration or tasks with respect to other collaborators. In the rare case that a client project needs creative talents that we don’t offer (e.g. particularly stylized stills photography), we are transparent with our clients and let them weigh in and help choose before we hire talent.",
      "We always established clear deal memos and/or scope of work agreements with subcontractors to make sure that there are no rights issues or misunderstandings.",
      "Team Assets",
      "Our studio has an extensive amount of gear, including a Sony FX6 camera, professional lenses, lighting equipment, and audio equipment. This can give us great pricing flexibility, as we set our rental rates based on our clients, e.g. we can give beneficial rates for good causes or projects with high alignment with our values, or to stretch a budget to work with a client we want to work with.",
      "We use the Adobe suite as well as Davinci Resolve for our projects, but also have experience using Final Cut Pro and Avid. We have professional Vimeo and Google Drive and Frame.io accounts to help us deliver projects to clients and to allow client review of projects.",
      "We have relationships with local studio spaces and can negotiate beneficial rates with them for shoot days.",
      "All of our projects are minimum double-backed-up in secure hard drive storage, including all assets, footage and project files. If, at a later date, a project needs to come out of the archive, we will have it at the ready."
    ],
    "images": []
  },
  {
    "filename": "Services PDF Juniper Island.pptx",
    "type": "pptx",
    "slides": [
      {
        "slide_number": 1,
        "file": "ppt/slides/slide1.xml",
        "text": [
          "Elevating Brands",
          "Storytelling & Digital Services Portfolio",
          "November 2023"
        ]
      },
      {
        "slide_number": 2,
        "file": "ppt/slides/slide10.xml",
        "text": [
          "Let’s Connect",
          "Ready to elevate your brand? Let's create something amazing together.",
          "Johnny Hockin",
          "Creative Director",
          "johnny@juniperisland.ca",
          "(647) 969-3452",
          "Nina Gilmour",
          "Producer",
          "ninagilmour6@gmail.com",
          "(416) 839-9152"
        ]
      },
      {
        "slide_number": 3,
        "file": "ppt/slides/slide11.xml",
        "text": [
          "Thank",
          "You",
          "Storytelling & Digital Services Portfolio",
          "November 2023"
        ]
      },
      {
        "slide_number": 4,
        "file": "ppt/slides/slide2.xml",
        "text": [
          "Table",
          "Contents",
          "Video Creation . . . . . . . . . . . . . . . . . . . . . . 12",
          "Social Media Management . . . . . . . . 10",
          "Social Media Ad Buying . . . . . . . . . . . . 11",
          "Our Process . . . . . . . . . . . . . . . . . . . . . . . . . 12",
          "Success Stories . . . . . . . . . . . . . . . . . . . . .13",
          "Next Steps . . . . . . . . . . . . . . . . . . . . . . . . . . .15"
        ]
      },
      {
        "slide_number": 5,
        "file": "ppt/slides/slide3.xml",
        "text": [
          "Our Philosophy",
          "We believe in the power of stories to captivate, engage, and inspire.",
          "Story-Driven Approach",
          "Audience-Centric Strategies",
          "Performance Marketing Delivery to Drive Results"
        ]
      },
      {
        "slide_number": 6,
        "file": "ppt/slides/slide4.xml",
        "text": [
          "Video Creation",
          "Services",
          "Crafting compelling visual stories that resonate and captivate.",
          "Customized Storytelling",
          "High Production Value",
          "Diverse Formats: Ads, Documentaries, Social Media Content",
          "Red Bull Spaces Documentary: Montreal (8 min)",
          "Muskoka Roastery Doc: The Challenge (16 min)",
          "TMU: FPPCM Program Spotlight MiniDoc (4 min)",
          "style.visibility",
          "style.visibility",
          "style.visibility"
        ]
      },
      {
        "slide_number": 7,
        "file": "ppt/slides/slide5.xml",
        "text": [
          "Social Media Management",
          "Strategically engaging your audience where they are.",
          "Tailored Content Calendars",
          "Consistent Brand Voice",
          "Effective Community Engagement",
          "Social SEO",
          "Performance Reporting",
          "Currently supporting clients with TikTok, Instagram, YouTube, Facebook, and Pinterest"
        ]
      },
      {
        "slide_number": 8,
        "file": "ppt/slides/slide6.xml",
        "text": [
          "Social Media Ad Buying",
          "Maximizing your brand's reach with targeted precision.",
          "Customized Campaigns with Ad Sequences",
          "Data-Driven Strategies and Retargeting",
          "ROI-Focused",
          "We service clients on Meta properties (Facebook/Instagram)"
        ]
      },
      {
        "slide_number": 9,
        "file": "ppt/slides/slide7.xml",
        "text": [
          "Create",
          "Craft",
          "Deliver",
          "Drive Impact",
          "Discover",
          "Define",
          "Our",
          "Process",
          "We dive deep to understand your brand's story and goals, ensuring we capture the essence of what makes your business unique.",
          "Our creative process turns your story into striking and emotionally engaging content that connects with your audience.",
          "We guide distribution of your content, organic or paid, to maximize impact and ensure your message reaches its target"
        ]
      },
      {
        "slide_number": 10,
        "file": "ppt/slides/slide8.xml",
        "text": [
          "Success",
          "Story",
          "Tailored to",
          "Trend",
          "Through seasonality and new trends we anticipate the content the Rily audience will be most engaged by in the months to come, achieving a 48% engagement increase since early 2023.",
          "Audience-Focused",
          "When Rily joined us, their understanding of their core audience - foodies facing dietary restrictions - needed clarity. We honed in on this demographic, crafting content that speaks directly to their unique POV.",
          "Impactful Ad Strategies",
          "Our targeted ad campaigns have significantly increased Rily's following and boosted sales, showcasing our expertise in driving measurable results through strategic marketing.",
          "Client: Rily",
          "Recipe website /",
          "foodie community",
          "21,000 Followers (Oct 2023)",
          "Social Media Management /",
          "Ad Buying"
        ]
      },
      {
        "slide_number": 11,
        "file": "ppt/slides/slide9.xml",
        "text": [
          "Our Commitment",
          "We're here to help your brand break through the noise with a unique voice that truly represents you.",
          "Collaborative Process",
          "We partner closely with you, ensuring every project aligns seamlessly with your brand's vision.",
          "Transparent Pricing",
          "No surprises. We offer clear, upfront cost estimates for all projects.",
          "Innovative Solutions",
          "We leverage cutting-edge techniques including extensive AI tools and up-to-the-minute creative insights to keep your brand at the forefront of industry trends."
        ]
      }
    ],
    "images": [
      {
        "name": "image13.png",
        "size": 3348,
        "path": "images/image13.png"
      },
      {
        "name": "image8.png",
        "size": 2244094,
        "path": "images/image8.png"
      },
      {
        "name": "image22.png",
        "size": 271381,
        "path": "images/image22.png"
      },
      {
        "name": "image16.jpg",
        "size": 315445,
        "path": "images/image16.jpg"
      },
      {
        "name": "image18.jpg",
        "size": 3472,
        "path": "images/image18.jpg"
      },
      {
        "name": "image7.png",
        "size": 1749916,
        "path": "images/image7.png"
      },
      {
        "name": "image29.png",
        "size": 2196115,
        "path": "images/image29.png"
      },
      {
        "name": "image12.png",
        "size": 3870,
        "path": "images/image12.png"
      },
      {
        "name": "image26.jpg",
        "size": 366932,
        "path": "images/image26.jpg"
      },
      {
        "name": "image21.png",
        "size": 22128,
        "path": "images/image21.png"
      },
      {
        "name": "image10.png",
        "size": 1682111,
        "path": "images/image10.png"
      },
      {
        "name": "image24.png",
        "size": 1023902,
        "path": "images/image24.png"
      },
      {
        "name": "image11.png",
        "size": 12369,
        "path": "images/image11.png"
      },
      {
        "name": "image19.png",
        "size": 868346,
        "path": "images/image19.png"
      },
      {
        "name": "image5.png",
        "size": 2217197,
        "path": "images/image5.png"
      },
      {
        "name": "image23.png",
        "size": 372793,
        "path": "images/image23.png"
      },
      {
        "name": "image20.jpg",
        "size": 307710,
        "path": "images/image20.jpg"
      },
      {
        "name": "image4.png",
        "size": 91727,
        "path": "images/image4.png"
      },
      {
        "name": "image17.png",
        "size": 56617,
        "path": "images/image17.png"
      },
      {
        "name": "image3.png",
        "size": 458724,
        "path": "images/image3.png"
      },
      {
        "name": "image25.png",
        "size": 1351600,
        "path": "images/image25.png"
      },
      {
        "name": "image2.png",
        "size": 316169,
        "path": "images/image2.png"
      },
      {
        "name": "image1.png",
        "size": 15532,
        "path": "images/image1.png"
      },
      {
        "name": "image28.png",
        "size": 1507104,
        "path": "images/image28.png"
      },
      {
        "name": "image15.png",
        "size": 7174,
        "path": "images/image15.png"
      },
      {
        "name": "image6.jpg",
        "size": 365622,
        "path": "images/image6.jpg"
      },
      {
        "name": "image27.png",
        "size": 1304731,
        "path": "images/image27.png"
      },
      {
        "name": "image14.png",
        "size": 14408,
        "path": "images/image14.png"
      },
      {
        "name": "image9.png",
        "size": 223198,
        "path": "images/image9.png"
      }
    ]
  }
]